# YOLO11-P2P3P4 detection model — P2/P3/P4 outputs (shifted pyramid, no P5)
# For datasets dominated by small objects (>50% small AND <10% large at training imgsz)
# EXPERIMENTAL — see OPEN-001 in spec. Verify before production use.
# Do NOT edit nc — Ultralytics auto-overrides from data.yaml

nc: 80
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# YOLO11 backbone (identical to standard)
backbone:
  - [-1, 1, Conv, [64, 3, 2]]              # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]             # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]      # 2
  - [-1, 1, Conv, [256, 3, 2]]             # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]      # 4
  - [-1, 1, Conv, [512, 3, 2]]             # 5-P4/16
  - [-1, 2, C3k2, [512, True]]             # 6
  - [-1, 1, Conv, [1024, 3, 2]]            # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]            # 8
  - [-1, 1, SPPF, [1024, 5]]               # 9
  - [-1, 2, C2PSA, [1024]]                 # 10

# YOLO11-P2P3P4 head — top-down to P2, bottom-up to P4 only (no P5 detection)
head:
  # --- Top-down ---
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]              # cat backbone P4
  - [-1, 2, C3k2, [512, False]]            # 13

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]              # cat backbone P3
  - [-1, 2, C3k2, [256, False]]            # 16

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 2], 1, Concat, [1]]              # cat backbone P2
  - [-1, 2, C3k2, [128, False]]            # 19 (P2/4-xsmall)

  # --- Bottom-up (stops at P4) ---
  - [-1, 1, Conv, [128, 3, 2]]
  - [[-1, 16], 1, Concat, [1]]             # cat head P3
  - [-1, 2, C3k2, [256, False]]            # 22 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]]             # cat head P4
  - [-1, 2, C3k2, [512, False]]            # 25 (P4/16-medium)

  - [[19, 22, 25], 1, Detect, [nc]]        # Detect(P2, P3, P4) — no P5
